Котельников_АБ_70153995/src/Documents/ЗатратыНаВакансию/ЗатратыНаВакансию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗатратыНаВакансию</name>
  <registerRecords>AccumulationRegister.ЗатратыНаВакансии</registerRecords>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтоимостьРазмещения</name>
    <attributes>
      <name>ДатаОплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сайт</name>
      <type>
        <types>CatalogRef.ИсточникиПривлечения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифныйПлан</name>
      <type>
        <types>CatalogRef.ТарифныеПланы</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Котельников_АБ_70153995/src/InformationRegisters/ТарифыВакансий/ТарифыВакансий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифыВакансий</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СайтВакансии</name>
    <type>
      <types>CatalogRef.ИсточникиПривлечения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифныйПлан</name>
    <type>
      <types>CatalogRef.ТарифныеПланы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Котельников_АБ_70153995/src/Documents/ЗатратыНаВакансию/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда	
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		Объект.Ответственный = ТекущийПользователь.Сотрудник;
		Объект.АвторДокумента = ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьРазмещенияТарифныйПланПриИзменении(Элемент)

	ТекущаяСтрокаТЧ = Элементы.СтоимостьРазмещения.ТекущиеДанные;
	СтоимостьТарифногоПлана = ПолучитьЦенуРазмещенияВакансии(ТекущаяСтрокаТЧ.Сайт, ТекущаяСтрокаТЧ.ТарифныйПлан);
	Если СтоимостьТарифногоПлана = 0 Тогда
		ОбщегоНазначенияКлиент.ВывестиСообщение("Не установлена цена для тарифного плана  - " + ТекущаяСтрокаТЧ.ТарифныйПлан);
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрокаТЧ.Цена = СтоимостьТарифногоПлана;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьЦенуРазмещенияВакансии(Сайт, ТарифныйПлан)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("СайтВакансии", Сайт); 
	ПараметрыОтбора.Вставить("ТарифныйПлан", ТарифныйПлан);
	
	ЦенаВакансии = РегистрыСведений.ТарифыВакансий.ПолучитьПоследнее(, ПараметрыОтбора); 
	
	Возврат ЦенаВакансии.Цена; 	

КонецФункции
